using System;

namespace _02._Equal_Sums_Even_Odd_Position
{
    class Program
    {
        static void Main(string[] args)
        {
            //четем две числа от конзолата;
            int num1 = int.Parse(Console.ReadLine());
            int num2 = int.Parse(Console.ReadLine());
            
            //създаваме цикъл, с които отпечатваме всички числа между num1 и num2, включително.
            for (int i = num1; i <= num2; i++)
            {
                //създаваме две променливи, които да отчитат сумата на четните и нечетните позиции във всяко число
                int evenSum = 0; //сумата на четните позиции на числото; като е зададена тук променилвата се нулира всеки път след като минат интерациите на вътрешния цикъл
                int oddSum = 0; //сумата на нечетните позиции на числото; "сумата" реално е на string-ове, които се преобразуват чрез ASCII таблица;
                string currentNumber = i.ToString(); //създаваме променлива, която е съответното число "i" от цикъла, преобразувано с ToString метод от число/int в string

                for (int j = 0; j < currentNumber.Length; j++) //създаваме втори цикъл, който чете позицията на всяко "число", което вече е string (j започва от 0, което е първата цифра от числото
                {
                    if (j%2 == 0) // при четна позиция на "числото" се добавя към четната сума; това са позиции 0, 2, 4, 6...
                    {
                        evenSum += currentNumber[j]; // със [] се чете char; на 0 позиция е char '1', който според ASCII таблицата е равен на 49
                    }

                    else //при нечетна позиция на "числото" се добавя към нечетната сума; това са позиции 1, 3, 5, 7 ...
                    {
                        oddSum += currentNumber[j]; // със [] се чете char; на позиция 1 е char "0", който според ASCII таблицата е равен на 48
                    }
                }

                if (evenSum == oddSum) //проверка дали числото отговаря на условието на задачата сумата от четните позиции да е равна на сумата на нечетените позици
                {
                    Console.Write(currentNumber+" "); //печатаме съответното число, което отговаря на условието
                } 
                
            }
        }
    }
}
